Repository: giellalt/corpus-sme
Catalog: prestable/tmx/eng/admin/sd/samediggi.no/samediggi-article-2381.html.tmx
Source language: sme
Languages: eng

source: PRD.: James Anaya nammaduvvon ON erenoamášdieđiheaddjin eamiálbmot vuoigatvuođaid ja vuođđo vuoigatvuođaid ektui
eng: James Anaya appointed as UN Special rapporteur on the rights and fundamental freedoms of indigenous peoples.

source: Sámi parlamentáralaš ráđi ovddas sávan mun lihku James Anayai go lea nammaduvvon ON erenoamášdieđiheaddjin, dadjá Sámi parlamentáralaš ráđi presideanta Egil Olli.
eng: - On the behalf of the Saami Parliamentary Council I want to congratulate Mr James Anaya with his appointment as UN Special rapporteur, says president of the Saami Parliamentary Council Egil Olli.

source: Háliidan maid sávvat lihku ON olmmošvuoigatvuođaid ráđđái nammademiin.
eng: I also want to congratulate the Human Rights Council for their decision of appointing Mr Anaya as special rapporteur.

source: Anayas lea dakkár olmmošlaš ja fágalaš bealit mat dagahit dan ahte sus šaddá hui buorre erenoamášdieđiheaddji.
eng: - Mr Anaya has both professional and personal qualities that should make him well qualified as the next special rapporteur on the rights and fundamental freedoms of Indigenous peoples.

source: Dasto háliidan loahpas vel erenoamážit giitit Rodolfo Stavenhagena dan barggu ovddas maid son lea dahkan ON erenoamášdieđiheaddjin eamiálbmotvuoigatvuođaid ja vuođđo vuoigatvuođaid hárrái.
eng: Last but not least, I want to express our gratitude to Mr Rodolfo Stavenhagen.

source: Stavenhagena vuohki čađahit bargguidis erenoamášdieđiheaddjin lea buorre ovdamearka.
eng: Mr. Stavenhagen ' s way of approach and efforts to carry out the mandate for the greater good of indigenous peoples, has established standards that surely can serve as guidelines for the new mandate holder.

source: – Mun lean vissis das ahte Anaya ollašuhttá daid vuordámušaid mat mis leat sutnje, ja Sámi parlamentáralaš ráđđi vuordá mielas ovttas bargat ođđa erenoamášdieđiheaddjin, dadjá Olli loahpas.
eng: - I am sure that Mr Anaya will live up to our expectations, and the Saami Parliamentary Council look forward to working with the new special rapporteur, says Olli in closing.

source: Sámi parlamentáralaš ráđi presideanta
eng: President of the Saami Parliamentary Council
